Revit 2027 API
IExternalEventHandler.GetName Method
 String identification of the event handler.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetName()
Function GetName As String
String^ GetName()
abstract GetName : unit -> string
Return Value
String
 The event's name
See Also
Reference
IExternalEventHandler Interface
Autodesk.Revit.UI Namespace